## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_quicksight_data_set.notification_history_joined` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_quicksight_data_set.notification_history_joined will be created
  + resource "aws_quicksight_data_set" "notification_history_joined" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "notification_history_joined"
      + id             = (known after apply)
      + import_mode    = "SPICE"
      + name           = "Notification history_joined"
      + output_columns = (known after apply)
      + tags_all       = (known after apply)

      + data_set_usage_configuration {
          + disable_use_as_direct_query_source = (known after apply)
          + disable_use_as_imported_source     = (known after apply)
        }

      + logical_table_map {
          + alias                = "Intermediate Table"
          + logical_table_map_id = "nh-services-joined"

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = [
                      + "id",
                      + "job_id",
                      + "job_row_number",
                      + "service_id",
                      + "template_id",
                      + "template_version",
                      + "api_key_id",
                      + "key_type",
                      + "notification_type",
                      + "created_at",
                      + "sent_at",
                      + "sent_by",
                      + "updated_at",
                      + "billable_units",
                      + "notification_status",
                      + "queue_name",
                      + "feedback_type",
                      + "feedback_subtype",
                      + "service_active",
                      + "service_count_as_live",
                      + "service_go_live_at",
                      + "service_name",
                      + "service_message_limit",
                      + "service_rate_limit",
                      + "service_sms_daily_limit",
                    ]
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = (known after apply)
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = "notification-history"
                  + on_clause     = "{service_id} = {id[Services]}"
                  + right_operand = "services"
                  + type          = "INNER"

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }
      + logical_table_map {
          + alias                = "notification_history"
          + logical_table_map_id = "notification-history"

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = (known after apply)
                  + new_column_name = (known after apply)
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = "arn:aws:quicksight:ca-central-1:239043911459:dataset/notification_history"
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }
      + logical_table_map {
          + alias                = "services"
          + logical_table_map_id = "services"

          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "id"
                  + new_column_name = "id[Services]"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "updated_at"
                  + new_column_name = "service_updated_at"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "created_at"
                  + new_column_name = "service_created_at"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "active"
                  + new_column_name = "service_active"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "count_as_live"
                  + new_column_name = "service_count_as_live"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "go_live_at"
                  + new_column_name = "service_go_live_at"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "name"
                  + new_column_name = "service_name"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "message_limit"
                  + new_column_name = "service_message_limit"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "rate_limit"
                  + new_column_name = "service_rate_limit"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }
          + data_transforms {
              + cast_column_type_operation {
                  + column_name     = (known after apply)
                  + format          = (known after apply)
                  + new_column_type = (known after apply)
                }

              + create_columns_operation {
                  + columns {
                      + column_id   = (known after apply)
                      + column_name = (known after apply)
                      + expression  = (known after apply)
                    }
                }

              + filter_operation {
                  + condition_expression = (known after apply)
                }

              + project_operation {
                  + projected_columns = (known after apply)
                }

              + rename_column_operation {
                  + column_name     = "sms_daily_limit"
                  + new_column_name = "service_sms_daily_limit"
                }

              + tag_column_operation {
                  + column_name = (known after apply)

                  + tags {
                      + column_geographic_role = (known after apply)

                      + column_description {
                          + text = (known after apply)
                        }
                    }
                }

              + untag_column_operation {
                  + column_name = (known after apply)
                  + tag_names   = (known after apply)
                }
            }

          + source {
              + data_set_arn      = "arn:aws:quicksight:ca-central-1:239043911459:dataset/services"
              + physical_table_id = (known after apply)

              + join_instruction {
                  + left_operand  = (known after apply)
                  + on_clause     = (known after apply)
                  + right_operand = (known after apply)
                  + type          = (known after apply)

                  + left_join_key_properties {
                      + unique_key = (known after apply)
                    }

                  + right_join_key_properties {
                      + unique_key = (known after apply)
                    }
                }
            }
        }

      + permissions {
          + actions   = [
              + "quicksight:CancelIngestion",
              + "quicksight:CreateIngestion",
              + "quicksight:DeleteDataSet",
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
              + "quicksight:UpdateDataSet",
              + "quicksight:UpdateDataSetPermissions",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
        }
      + permissions {
          + actions   = [
              + "quicksight:DescribeDataSet",
              + "quicksight:DescribeDataSetPermissions",
              + "quicksight:DescribeIngestion",
              + "quicksight:ListIngestions",
              + "quicksight:PassDataSet",
            ]
          + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notification_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notification_history_joined"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates_history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

33 tests, 17 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
